src/Catalogs/ШаблоныШК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>ШаблоныШК</Name>
			<Comment>для идентификации штих-кодов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПорядокКодВес</Name>
					<Comment>в каком порядке находятся "код, вес" или "вес, код"</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДлинаКода</Name>
					<Comment>количество знаков отведенное для кода</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МножительКоличества</Name>
					<Comment>Множитель количества</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыШаблоновШК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ШаблоныШК/Forms/ФормаЭлемента/module.bsl
// 
Процедура ПриОткрытии()
		
	ТестКодТовара			= 11;
	ТестКоличествоТовара	= 0.5;
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// При изменении префикса
//
Процедура КодПриИзменении(Элемент)
	
	Если СтрДлина(СокрЛП(Код)) < 2 Тогда
		Код = Прав("00" + СокрЛП(Код), 2);
	КонецЕсли;	
	
	ФормированиеТестовогоШК();
	ЗаполнитьШаблон();
КонецПроцедуры

// При изменении последовательности представления ШК "код, вес" или "вес, код"
//
Процедура ПорядокКодВесПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// При изменении длины кода
//
Процедура ДлинаКодаПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();

КонецПроцедуры

// При изменении множителя количества
//
Процедура МножительКоличестваПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();	
	
КонецПроцедуры

// При изменении кода товара для теста
//
Процедура ТестКодТовараПриИзменении(Элемент)
		
	ФормированиеТестовогоШК();  
	
КонецПроцедуры

// При изменении количества (веса) товара для теста
//
Процедура ТестКоличествоТовараПриИзменении(Элемент)
	
	ФормированиеТестовогоШК();
	
КонецПроцедуры

// Формирование ШК из теста
//
Процедура ФормированиеТестовогоШК()
	
	Если НЕ ЗначениеЗаполнено(ТестКодТовара) ИЛИ НЕ ЗначениеЗаполнено(ТестКоличествоТовара) Тогда
		Возврат;
	КонецЕсли;	
	
	Если СтрДлина(СокрЛП(Формат(ТестКодТовара,"ЧГ="))) > ДлинаКода Тогда
		Сообщить("ТЕСТ: Длина кода больше заданной. Настроенное количество знаков " + ДлинаКода);
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;
	
	ТестовоеКоличество = ТестКоличествоТовара / МножительКоличества;
	
	Если СтрДлина(СокрЛП(Формат(ТестовоеКоличество,"ЧГ="))) > 10 - ДлинаКода Тогда
		Сообщить("ТЕСТ: Длина количества больше заданной. Настроенное количество знаков " + (10 - ДлинаКода));
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;
	
	Если ТестовоеКоличество < 1 Тогда
		Сообщить("ТЕСТ: Длина количества меньше ""0"". Не корректно задан один из параметров ""Множитель количества"" или тестовое ""Кол-во"" ");
		ЭлементыФормы.НадписьТестТелоШК.Заголовок				= "ХХХХХХХХХХ";
		ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= "Х";
		Возврат;
	КонецЕсли;	
	
	ТестовыйКод			= Формат(ТестКодТовара, "ЧВН=; ЧГ=0; ЧЦ=" + ДлинаКода);
	ТестовоеКоличество	= Формат(ТестовоеКоличество, "ЧВН=; ЧГ=0; ЧЦ=" + (10 - ДлинаКода));
	
	Попытка
		ТестовыйШК = СформироватьШК( Код + ?(ПорядокКодВес, ТестовыйКод + ТестовоеКоличество, ТестовоеКоличество + ТестовыйКод));
	Исключение
	КонецПопытки;
	
	ЭлементыФормы.НадписьТестКонтрольныйСимволШК.Заголовок	= Прав(ТестовыйШК, 1);
	ЭлементыФормы.НадписьТестТелоШК.Заголовок				= Сред(ТестовыйШК, 3, 10);
	
КонецПроцедуры
